- https://github.com/fogleman/AdventOfCode2021/
- https://github.com/cl2333/Grokking-the-Coding-Interview-Patterns-for-Coding-Questions
- https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed
- https://malisper.me/an-algorithm-for-passing-programming-interviews/
- https://ourmachinery.com/post/data-structures-part-1-bulk-data/
- https://github.com/matramos/elrejunte
  https://github.com/undefinedfceia/guardian-tortuga
- https://github.com/ec24/tc-arg
  https://www.youtube.com/user/ltaravilse/videos
- https://github.com/jwasham/coding-interview-university
- CS170 - Efficient Algorithms and Intractable Problems https://cs170.org/
- Competitive https://cses.fi/problemset/
***** Try solve_t
   #+NAME: main
   #+begin_src C :noweb yes
   #include <stdio.h>
   <<solve_t>>
   int main() {
     printf("%d\n", solve_t(4,9,22));
     printf("%d\n", solve_t(4,9,54));
     printf("%d\n", solve_t(4,9,15));
     exit(0);
   }
   #+end_src

   #+RESULTS: main
   |  3 |
   | 11 |
   | -1 |
***** Try all
  #+begin_src C :noweb yes
  #include <stdio.h>
  <<solve_t>>
  <<solve>>
  int main() {
    solve(4,9,22);
    solve(4,9,54);
    solve(4,9,15);
    exit(0);
  }
  #+end_src

  #+RESULTS:
  |  3 |   |
  | 11 |   |
  |  2 | 2 |
